# GetIdsToInclude Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIdSetFilter..::..GetIdsToInclude Method
ElementIdSetFilter Class See Also
---
Returns the ids of this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ICollection<ElementId> GetIdsToInclude()
```

Visual Basic
---
```text
Public Function GetIdsToInclude As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetIdsToInclude()
```

# ### Return Value
The collection of ids.
# See Also
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace